create_library_set -name default -timing {/home/cad/lib/NANGATE45//typical.lib}
create_constraint_mode -name default -sdc_files {mips32.sdc}
create_delay_corner -name default -library_set {default}
create_analysis_view -name default -constraint_mode {default} -delay_corner {default}
set_analysis_view -setup {default} -hold {default}
