if {![namespace exists ::IMEX]} { namespace eval ::IMEX {} }
set ::IMEX::dataVar [file dirname [file normalize [info script]]]
set ::IMEX::libVar ${::IMEX::dataVar}/libs

create_library_set -name default\
   -timing\
    [list ${::IMEX::libVar}/mmmc/typical.lib]
create_rc_corner -name default_rc_corner\
   -preRoute_res 1\
   -postRoute_res 1\
   -preRoute_cap 1\
   -postRoute_cap 1\
   -postRoute_xcap 1\
   -preRoute_clkres 0\
   -preRoute_clkcap 0
create_delay_corner -name default\
   -library_set default
create_constraint_mode -name default\
   -sdc_files\
    [list ${::IMEX::dataVar}/mmmc/modes/default/default.sdc]
create_analysis_view -name default -constraint_mode default -delay_corner default -latency_file ${::IMEX::dataVar}/mmmc/views/default/latency.sdc
set_analysis_view -setup [list default] -hold [list default]
